Catalogs/упПравилаДоступностиГеографическихЗон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упПравилаДоступностиГеографическихЗон</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапрещенаРаботаВУказанныхЗонах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГеографическиеЗоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГеографическаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/упИерархияГеографическихЗон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упИерархияГеографическихЗон</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упДоступныеГеографическиеЗоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упДоступныеГеографическиеЗоны</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПравилаДоступности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаДоступностиГеографическихЗон</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГеографическаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/упПравилаДоступностиГеографическихЗон/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗапрещенаРаботаВУказанныхЗонах Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ГеографическиеЗоны");
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упИерархияГеографическихЗон.Зона
	|ПОМЕСТИТЬ втЗоны
	|ИЗ
	|	Справочник.упПравилаДоступностиГеографическихЗон.ГеографическиеЗоны КАК упПравилаДоступностиГеографическихЗонГеографическиеЗоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упИерархияГеографическихЗон КАК упИерархияГеографическихЗон
	|		ПО упПравилаДоступностиГеографическихЗонГеографическиеЗоны.ГеографическаяЗона = упИерархияГеографическихЗон.Родитель
	|ГДЕ
	|	упПравилаДоступностиГеографическихЗонГеографическиеЗоны.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упГеографическиеЗоны.Ссылка КАК Зона
	|ИЗ
	|	Справочник.упГеографическиеЗоны КАК упГеографическиеЗоны
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЗоны КАК втЗоны
	|		ПО упГеографическиеЗоны.Ссылка = втЗоны.Зона
	|ГДЕ
	|	(&ЗапрещенаРабота
	|				И втЗоны.Зона ЕСТЬ NULL 
	|			ИЛИ НЕ &ЗапрещенаРабота
	|				И НЕ втЗоны.Зона ЕСТЬ NULL )";
	Запрос.УстановитьПараметр("Ссылка",          Ссылка);
	Запрос.УстановитьПараметр("ЗапрещенаРабота", ЗапрещенаРаботаВУказанныхЗонах);
	
	НаборЗаписей = РегистрыСведений.упДоступныеГеографическиеЗоны.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПравилаДоступности.Установить(Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Запись = НаборЗаписей.Добавить();
		Запись.ПравилаДоступности = Ссылка;
		Запись.ГеографическаяЗона = Выборка.Зона;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
